Revit 2027 API
OpenConflictScenario Enumeration
 The kinds of conflicts happened during open.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OpenConflictScenario
Public Enumeration OpenConflictScenario
public enum class OpenConflictScenario
type OpenConflictScenario
Members
Member name | Value | Description
OutOfDate | 2 |  Model is out of date.
Relinquished | 1 |  Ownership to model elements is relinquished.
Rollback | 0 |  Central model is restored to an earlier version.
VersionArchived | 3 |  Last central version merged into the local model has been archived in the central model.
See Also
Reference
Autodesk.Revit.DB Namespace